RT-Thread/rt-thread/bsp/stm32/libraries/STM32WLxx_HAL/STM32WLxx_HAL_Driver/Src/stm32wlxx_hal.c
  LL_VREFBUF_SetVoltageScaling(VoltageScaling);

  /* Restrieve Calibration data and store them into trimming field */
  if (VoltageScaling == SYSCFG_VREFBUF_VOLTAGE_SCALE0)
  {
    TrimmingValue = ((uint32_t) *VREFBUF_SC0_CAL_ADDR) & 0x3FU;
  }
  else
  {
    TrimmingValue = ((uint32_t) *VREFBUF_SC1_CAL_ADDR) & 0x3FU;
  }
  assert_param(IS_SYSCFG_VREFBUF_TRIMMING(TrimmingValue));

  HAL_SYSCFG_VREFBUF_TrimmingConfig(TrimmingValue);
}

/**
  * @brief Configure the internal voltage reference buffer high impedance mode.
  * @param Mode  specifies the high impedance mode
  *          This parameter can be one of the following values:
  *            @arg @ref SYSCFG_VREFBUF_HIGH_IMPEDANCE_DISABLE : VREF+ pin is internally connect to VREFINT output.
  *            @arg @ref SYSCFG_VREFBUF_HIGH_IMPEDANCE_ENABLE : VREF+ pin is high impedance.
  * @retval HAL_OK/HAL_TIMEOUT
  */
void HAL_SYSCFG_VREFBUF_HighImpedanceConfig(uint32_t Mode)
{

  /* Check the parameters */
  assert_param(IS_SYSCFG_VREFBUF_HIGH_IMPEDANCE(Mode));

  MODIFY_REG(VREFBUF->CSR, VREFBUF_CSR_HIZ, Mode);
}

/**
  * @brief Tune the Internal Voltage Reference buffer (VREFBUF).
  * @note  Each VrefBuf voltage scale is calibrated in production for each device,
  *        data stored in flash memory.
  *        Function @ref HAL_SYSCFG_VREFBUF_VoltageScalingConfig retrieves and
  *        applies this calibration data as trimming value at each scale change.
  *        Therefore, optionally, function @ref HAL_SYSCFG_VREFBUF_TrimmingConfig
  *        can be used in a second time to fine tune the trimming.
  * @param TrimmingValue specifies trimming code for VREFBUF calibration
  *          This parameter can be a number between Min_Data = 0x00 and Max_Data = 0x3F
  * @retval None
  */
void HAL_SYSCFG_VREFBUF_TrimmingConfig(uint32_t TrimmingValue)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_VREFBUF_TRIMMING(TrimmingValue));

  LL_VREFBUF_SetTrimming(TrimmingValue);

}

/**
  * @brief  Enable the Internal Voltage Reference buffer (VREFBUF).
  * @retval HAL_OK/HAL_TIMEOUT
  */
HAL_StatusTypeDef HAL_SYSCFG_EnableVREFBUF(void)
{
  uint32_t tickstart;

  LL_VREFBUF_Enable();

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Wait for VRR bit  */
  while (READ_BIT(VREFBUF->CSR, VREFBUF_CSR_VRR) == 0U)
  {
    if ((HAL_GetTick() - tickstart) > VREFBUF_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Disable the Internal Voltage Reference buffer (VREFBUF).
  *
  * @retval None
  */
void HAL_SYSCFG_DisableVREFBUF(void)
{
  LL_VREFBUF_Disable();
}

/**
  * @brief  Enable the I/O analog switch voltage booster
  *
  * @retval None
  */
void HAL_SYSCFG_EnableIOAnalogSwitchBooster(void)
{
  LL_SYSCFG_EnableAnalogBooster();
}

/**
  * @brief  Disable the I/O analog switch voltage booster
  *
  * @retval None
  */
void HAL_SYSCFG_DisableIOAnalogSwitchBooster(void)
{
  LL_SYSCFG_DisableAnalogBooster();
}

#if defined(DUAL_CORE)
/**
  * @brief  Enable Additional Interrupt Mask
  * @note   This interface is an additional interrupt masking interface
  *         up to the EXTI interface
  * @param  Interrupt Pointer to a SYSCFG_InterruptTypeDef structure that contains
  *                   the Interrupt Mask configuration
  * @retval None
  */
void HAL_SYSCFG_EnableIT(SYSCFG_InterruptTypeDef *Interrupt)
{
  uint32_t InterruptMask1 = (Interrupt->InterruptMask1 & ~HAL_SYSCFG_GRP1_RESERVED);
  uint32_t InterruptMask2 = (Interrupt->InterruptMask2 & ~HAL_SYSCFG_GRP2_RESERVED);

  /* Check the parameters */
  assert_param(IS_SYSCFG_IM_GRP1(Interrupt->InterruptMask1));
  assert_param(IS_SYSCFG_IM_GRP2(Interrupt->InterruptMask2));

#if defined(CORE_CM0PLUS)
  LL_C2_SYSCFG_GRP1_EnableIT(InterruptMask1);
  LL_C2_SYSCFG_GRP2_EnableIT(InterruptMask2);
#else
  LL_SYSCFG_GRP1_EnableIT(InterruptMask1);
  LL_SYSCFG_GRP2_EnableIT(InterruptMask2);
#endif
}

/**
  * @brief  Disable Additional Interrupt Mask
  * @note   This interface is an additional interrupt masking interface
  *         up to the EXTI interface
  * @param  Interrupt Pointer to a SYSCFG_InterruptTypeDef structure that contains
  *                   the Interrupt Mask configuration
  * @retval None
  */
void HAL_SYSCFG_DisableIT(SYSCFG_InterruptTypeDef *Interrupt)
{
  uint32_t InterruptMask1 = (Interrupt->InterruptMask1 & ~HAL_SYSCFG_GRP1_RESERVED);
  uint32_t InterruptMask2 = (Interrupt->InterruptMask2 & ~HAL_SYSCFG_GRP2_RESERVED);

  /* Check the parameters */
  assert_param(IS_SYSCFG_IM_GRP1(Interrupt->InterruptMask1));
  assert_param(IS_SYSCFG_IM_GRP2(Interrupt->InterruptMask2));

#if defined(CORE_CM0PLUS)
  LL_C2_SYSCFG_GRP1_DisableIT(InterruptMask1);
  LL_C2_SYSCFG_GRP2_DisableIT(InterruptMask2);
#else
  LL_SYSCFG_GRP1_DisableIT(InterruptMask1);
  LL_SYSCFG_GRP2_DisableIT(InterruptMask2);
#endif
}
#endif /* DUAL_CORE */
/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
